---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimUnConnError
source: html/6befc086-4872-4100-2061-9adb02a8d226.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimUnConnError Property

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions, resulting in bad geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeBadDimUnConnError { get; }
```